---
kind: property
id: P:Autodesk.Revit.DB.LinkElementId.HostElementId
source: html/71df8d73-bd2a-6462-fd00-ca1c637200af.htm
---
# Autodesk.Revit.DB.LinkElementId.HostElementId Property

The id of the element in the host, or invalidElementId if there is a link.

## Syntax (C#)
```csharp
public ElementId HostElementId { get; }
```